Repository: STO11/MyProfile
Catalog: lib/l10n/intl_*.arb
Languages: pt

# title
source: My Profile
pt: Meu perfil

# aboutMe
source: I'm a senior PHP developer with over 10 years of experience in back-end and 7 years with mobile, programming since I was 16 years old. I have extensive experience in analysis, system development and application creation using the best technologies. I worked as a fullstack in several technologies and currently working with react native on a platform with millions of unique users.
pt: Sou desenvolvedor sênior PHP com mais de 10 anos de experiência em back-end e 7 anos com mobile, programo desde os 16 anos. Tenho grande experiência em análise, desenvolvimento e criação de aplicações usando as melhores tecnologias e atualmente estou trabalhando com React Native em uma plataforma com milhões de usuários únicos.

# myTechnicalSkillsSection
source: Hard skills
pt: Competências

# myExperiences
source: Experiences
pt: Experiências

source: Soft skills
pt: Interpessoais

# contact
source: About me
pt: Sobre mim

# descriptionDasa
source: Dasa is a large multinacional company in the health area, there i perform a role in development, maintenance and elaboration of the App Nav Patients structure consists of an integrated platform involving online consulting consults by stream, vaccines and diagnosis. I help and follow up on App's development, developing new functions and improving user experience, as well as also assisting team with mentories and collaboration with other developers.
pt: Dasa é uma grande empresa multinacional da área da saúde, lá desempenho um papel no desenvolvimento, manutenção e elaboração da estrutura do App Nav Pacientes que consiste em uma plataforma integrada envolvendo consultas “online” por stream, gerenciamento de exames, vacinas e diagnósticos. Ajudo e acompanho o desenvolvimento do App, desenvolvendo novas funcionalidades e melhorando a experiência do usuário, assim como também auxílio a equipe com mentorias e colaboração com outros desenvolvedores.

# descriptionDextra
source: At Dextra i worked on Dasa playing the role of Dev. React Native, later i was acquired by Dasa.
pt: Na Dextra trabalhei alocado na Dasa desempenhando o papel de Dev. React Native, posteriormente foi adquirido pela Dasa.

# descriptionJoin
source: Join is a software development company, which i was allocated to work in the Port of Santos system, transforming the system to legacy to a new web system, despite the short time i got greatting results and knowledge agregates.
pt: Join é uma empresa de desenvolvimento de software, da qual fui alocado para o trabalhar no sistema do Porto de Santos, tranformando o sistema legado para um novo sistema web. Apesar do pouco tempo obtive grandes resultados e conhecimentos.

# descriptionBredi
source: Bredi is a software factory on demand that works with many projects and clients, for a long time i was been responsible for many customer projects and mobile initiative on company (i was a precursor there). Besides i worked to make complete applications (back-end up until front-end), building of API's, websites, e-commerces and many types of mobile applications (deliverys, shops, sales and etc...)
pt: Bredi é uma fábrica de software por demanda que trabalha com vários projetos e clientes, por um longo período fui responsável pela iniciativa mobile na empresa, na qual fui o precursor, além disso, trabalhei como fullstack desde a concepção até entrega. Trabalhei com back-end ao front-end, construção de api's, website, e-commerces e aplicativos (delivery, vendas, lojas e etc...)

# descriptionInfoPublic
source: InfoPublic was my first job, it was a company that worked for local public companies. I was responsible been for the migration of many public projects to the web.
pt: A InfoPublic foi meu primeiro emprego, era uma empresa que trabalhava para empresas públicas locais. Fui responsável pela migração de muitos projetos públicos para web.

# rangeDasa
source: aug 2021 - current
pt: ago de 2021 - o momento

# rangeDextra
source: jun 2021 - aug 2021
pt: jun de 2021 - ago de 2021

# rangeJoin
source: feb 2021 - apr 2021
pt: fev de 2021 - abr de 2021

# rangeBredi
source: mar 2013 - feb 2021
pt: mar de 2013 - fev de 2021

# rangeInfoPublic
source: mar 2011 - feb 2013
pt: mar de 2011 - fev de 2013

# softSCommunication
source: Good comunication
pt: Boa comunicação

# softSTolerance
source: Resilience, tolerance and flexibility
pt: Resiliência, tolerância e flexibilidade

# softSResolution
source: Complex Problem Solving
pt: Resolução de Problemas Complexos

# softSMind
source: Critical Thinking
pt: Pensamento Crítico

# softSCreativity
source: Creativity
pt: Criatividade

# softSLearning
source: Active learning
pt: Aprendizado ativo

source: Technical
pt: Técnico

source: Languages
pt: Línguas
